resources/rails_app/app/controllers/cat_gifs_controller.rb

SELECT "cat_gifs".* FROM "cat_gifs"
---
  def index
    @cat_gifs = CatGif.all

UPDATE "cat_gifs" SET "score" = ?, "updated_at" = ? WHERE "cat_gifs"."id" = ?  [["score", 4], ["updated_at", "2015-09-14 00:06:05.943431"], ["id", 2]]
---
  def upvote
    @cat_gif.increment!(:score)

UPDATE "cat_gifs" SET "score" = ?, "updated_at" = ? WHERE "cat_gifs"."id" = ?  [["score", 5], ["updated_at", "2015-09-14 00:09:39.300399"], ["id", 2]]
---
  def downvote
    @cat_gif.decrement!(:score)

INSERT INTO "cat_gifs" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tag"], ["url", "http://meowgifs.com/wp-content/uploads/2012/11/cat-play.gif"], ["created_at", "2015-09-13 22:11:00.143655"], ["updated_at", "2015-09-13 22:11:00.143655"]]
---
  def create
    @cat_gif = CatGif.new(cat_gif_params)

    respond_to do |format|
      if @cat_gif.save

SELECT  "cat_gifs".* FROM "cat_gifs" WHERE "cat_gifs"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_cat_gif
      @cat_gif = CatGif.find(params[:id])