resources/rails_app/app/controllers/signups_controller.rb

SELECT "signups".* FROM "signups"
---
  def index
    @signups = Signup.all

INSERT INTO "signups" ("email_address", "created_at", "updated_at") VALUES (?, ?, ?)  [["email_address", "person@cat.com"], ["created_at", "2015-09-22 03:58:38.060251"], ["updated_at", "2015-09-22 03:58:38.060251"]]
---
  def create
    @signup = Signup.new(signup_params)
    @signup.save